// MazeGame.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <conio.h>
#include "time.h"
#include "windows.h"
#include "CrtLib.h"

using namespace std;
using namespace crt;

const int LX = 75;
const int LY = 30;
const int PLAYERCOL = COLOR_WHITE;
const int STANDARTCOL = COLOR_WHITE;
const int WALLCOL = COLOR_LIGHT_RED;
const int SCORECOL = COLOR_LIGHT_CYAN;
const int TIMECOL = COLOR_LIGHT_GREEN;
const int FEWTIMECOL = COLOR_LIGHT_RED;
const int EXITCOL = COLOR_GRAY;
const int MONEYCOL = COLOR_YELLOW;
const int ERRORCOL = COLOR_LIGHT_RED;
const int WINCOL = COLOR_LIGHT_GREEN;
const int LOSECOL = COLOR_LIGHT_CYAN;
const int ORDINARYTYPE = 0;
const int SCORETYPE = 1;
const int DIAMONDCOL = COLOR_LIGHT_CYAN;
const int TIMEUPCOL = COLOR_LIGHT_GREEN;
const int MINECOL = COLOR_BROWN;

const char player = (char)1;
// 0 - пустое пространство
// 1 - стена 
// 2 - выход
// 3 - игрок
// 4 - монета

int maze[LY][LX] = {
    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
    {1,0,0,4,0,0,0,0,0,0,1,0,0,4,0,0,0,0,1,0,0,0,0,0,1,0,4,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,6,0,0,0,0,0,4,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1},
    {1,1,1,1,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1},
    {1,0,0,0,0,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,1,0,0,0,1,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,0,5,1,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,1,0,0,0,1},
    {1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,0,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,0,1,1,1,0,1},
    {1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,1,0,1,0,0,0,1,0,1,0,1,0,1,0,1,4,0,0,1,0,1},
    {1,0,1,0,1,1,1,1,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,0,1,1,1,0,1,0,1},
    {1,0,1,0,0,0,0,0,0,4,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,0,0,1,6,0,0,1,0,1},
    {1,0,1,0,1,1,1,1,1,0,1,1,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1},
    {1,0,1,4,1,6,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,1,4,0,0,0,0,1,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,1,0,1,0,1,0,0,4,0,0,1,0,1},
    {1,4,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1},
    {1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,1,0,1,0,0,0,1,0,1,0,1,0,0,0,0,0,1,4,0,0,1,0,0,0,1,0,1,0,1},
    {1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,0,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,0,1,1,1,0,1,0,1},
    {1,0,1,0,0,0,1,0,0,0,1,5,0,0,1,0,1,0,0,0,1,6,0,0,1,0,1,0,1,0,0,0,0,0,1,0,1,0,1,0,0,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,4,1,0,1,0,0,0,0,0,1,0,0,0,1},
    {1,0,1,0,1,0,1,0,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,0,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,1,1,0,1,1,1,0,1},
    {1,0,1,0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,1,0,0,0,1,5,1,0,1,0,1,0,1,0,0,0,1,0,1,4,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,1,5,1,0,1},
    {1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,0,1,0,1},
    {1,0,1,0,1,0,0,0,0,0,4,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,1,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,1},
    {1,0,1,0,1,0,1,0,1,1,1,1,1,0,1,0,1,0,1,0,1,1,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,0,1},
    {1,0,1,0,1,6,1,0,1,0,0,0,1,0,1,0,1,0,1,0,1,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,1,0,1,0,1},
    {1,0,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,0,1,0,1,1,1,1,1,1,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,0,1,0,1,0,1,0,1},
    {1,0,1,0,0,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,5,1,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,1,0,1,0,1,0,0,0,1},
    {1,0,1,1,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,0,1,0,1,1,1,1,1},
    {1,0,0,0,0,0,1,0,0,0,1,0,1,0,4,0,1,0,0,0,0,0,0,0,1,0,1,0,0,4,0,0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,0,1,0,1,0,0,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,1,0,0,4,1},
    {1,1,1,0,1,0,1,0,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,1,0,1,1,1},
    {1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1,0,1,0,0,4,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0,1},
    {1,0,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,1,1,0,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,1,1,0,1,1,1,0,1,0,1,4,1,1,1,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,7,7,7,3,1},
    {1,0,0,4,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,1,0,0,0,1,0,1},
    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,1}
};
// глобальные переменные
int hx, hy; // позиция игрока в лабиринте
int score = 0; // счет игры

int gameState = 0; // 0 - игра продолжается, 1 - выигрыш, 2 - закончилось время
int timeLimit = 280;// лимит игры в секундах
int gameTime; // оставшееся время

clock_t tstart; // значение счетчика таймера при старте игры

void FrameMessage(int type, char message[], int lenght,  int setColor)
{
    setlocale(LC_ALL, "ru-RU");
    int widthFrame = lenght + 2;
    int heightFrame = 0;
    if (type == SCORETYPE) heightFrame = 4;
    else heightFrame = 3;
    int xMessage = (80 - widthFrame) / 2;
    int yMessage = (31 - heightFrame) / 2;
    GotoXY(xMessage, yMessage);
    SetTextColor(setColor);
    if (widthFrame > 0 || heightFrame > 0)
    {
        for (int ElemH = 1; ElemH <= widthFrame; ElemH++)
        {
            if (ElemH == 1 || ElemH == heightFrame)
            {
                for (int ElemW = 1; ElemW <= widthFrame; ElemW++)
                {
                    if (ElemW == 1 || ElemW == widthFrame) cout << "+";
                    else if (ElemW < widthFrame) cout << "-";
                    if (ElemW == widthFrame)
                    {
                        yMessage++;
                        GotoXY(xMessage, yMessage);
                    }
                }
            }
            else if (ElemH < heightFrame)
            {
                for (int ElemW = 1; ElemW <= widthFrame; ElemW++)
                {
                    if (ElemW == 1 || ElemW == widthFrame) cout << "|";
                    else if (ElemW < widthFrame) cout << " ";
                    if (ElemW == widthFrame)
                    {
                        yMessage++;
                        GotoXY(xMessage, yMessage);
                    }
                }
            }
        }
    }
    xMessage = ((80 - widthFrame) / 2) + 1;
    yMessage = ((31 - heightFrame) / 2) + 1;
    GotoXY(xMessage, yMessage);
    cout << message;
    if (type == SCORETYPE)
    {
        int lenghtScore = 1;
        int sc = score;
        while (sc != 0)
        {
            sc /= 10;
            lenghtScore++;
        }
        xMessage = ((80 - (10 + lenghtScore)) / 2);
        yMessage = yMessage + 1;
        GotoXY(xMessage, yMessage);
        cout << "Ваш счет: " << score;
    }
    SetTextColor(STANDARTCOL);
    setlocale(LC_ALL, "C");
    GotoXY(0,30);
}
// Функция обновляет текущий счет на экране
void UpdateScore(int score)
{
    GotoXY(35, 30); // ставим курсор на последнюю строку консоли
    setlocale(LC_ALL, "ru-RU"); // включаем локаль, ориентированную на кириллицу
    SetTextColor(STANDARTCOL);
    cout << "СЧЕТ: ";
    SetTextColor(SCORECOL);
    cout << score;  // выводим счет на экран
    SetTextColor(STANDARTCOL);
    setlocale(LC_ALL, "C"); // возвращаем настройки локали по умолчанию
}

// Функция обновляет оставшееся время до окончания игры
// параметр t функции - это текущее значение системного таймера, на момент вызова функции
void UpdateClock(clock_t t)
{
    gameTime = timeLimit - (t - tstart) / CLOCKS_PER_SEC; /* вычисляем оставшееся время в секундах
                    и помещаем результат в gameTime. (t-tstart) - кол-во миллисекунд, прошедшее
                    с момента старта игры. CLOCKS_PER_SEC - константа, определяющая количество
                    изменений системного таймера за 1 секунду. Для Windows это значение 
                    равно 1000. Вычитая из timeLimit время, прошедшее с начала игры, мы вычисляем
                    остаток времени в секундах */
    setlocale(LC_ALL, "ru-RU"); // переключаем локаль
    if (gameTime < 0) // проверяем, закончилось ли время
    {
        gameState = 2; // если да, то обновляем статус игры на 2 - игрок ПРОИГРАЛ
    }
    else
    {  // если время осталось
        GotoXY(49, 30); // ставим курсор на последнюю строку
        SetTextColor(STANDARTCOL);
        cout << "Осталось: ";
        if (gameTime > 15)
            SetTextColor(TIMECOL);
        else SetTextColor(FEWTIMECOL);
        cout << gameTime;
        SetTextColor(STANDARTCOL);
        cout << " секунд "; // выводим остаток времени в консоль
    }
    setlocale(LC_ALL, "C"); // восстанавливаем настройки локали
}

// Функция печатает в консоли лабиринт
void PrintMaze(int maze[LY][LX], int sizeX, int sizeY)
{
    for (int i = 0; i < sizeY; i++)
    {
        for (int j = 0; j < sizeX; j++)
        {
            switch (maze[i][j])
            {
            case 0:
                cout << ' ';
                break;
            case 1:
                SetTextColor(WALLCOL);
                cout << (char)178;
                break;
            case 2:
                SetTextColor(EXITCOL);
                cout << (char)176;
                break;
            case 3:
                SetTextColor(PLAYERCOL);
                cout << player;
                break;
            case 4:
                SetTextColor(MONEYCOL);
                cout << '$';
                break;
            case 5:
                SetTextColor(DIAMONDCOL);
                cout << (char)4;
                break;
            case 6:
                SetTextColor(TIMEUPCOL);
                cout << (char)30;
                break;
            case 7:
                SetTextColor(MINECOL);
                cout << (char)15;
                break;
            case 8:
                SetTextColor(MINECOL);
                cout << (char)15;
                break;
            default:
                cout << '?';
            }
        }
        cout << endl;
    }
}

// Функция определяет позицию игрока в массиве, обновляя значения глобальных переменных hx и hy
bool FindFirstPlayerPosition(int maze[LY][LX], int sizeX, int sizeY)
{
    int numbersExit = 0;
    int numbersPlayers = 0;
    for (int t = 0; t < sizeY; t++)
    {
        for (int k = 0; k < sizeX; k++)
        {
            if (maze[t][k] == 3)
                numbersPlayers++;
            else if (maze[t][k] == 2)
                numbersExit++;
        }
    }
    if (numbersPlayers == 1 && numbersExit > 0)
    {
        for (int i = 0; i < sizeY; i++)  // цикл пробегает массив по строкам
        {
            for (int j = 0; j < sizeX; j++) // цикл пробегает массив по столбцам
            {
                if (maze[i][j] == 3)    // проверяем, если текущий элемент равен 3 - нашли
                {                       // требуемую позицию
                    hx = j;             // записываем столбец в hx
                    hy = i;             // завершаем работу функции
                }
            }
        }
        return false;
    }
    else
    {
        return true;
    }   // если ничего не нашли - предполагаем, что игрок в позиции 0,0
}                   // это нелогично, но пока ничего предпринимать не будем, решение
                    // этой проблемы будет вашим персональным заданием по рефакторингу игры

//Функция скрывает игрока с экрана и убирает его из лабиринта
void HidePlayer()
{
    maze[hy][hx] = 0; // записываем в текущую позицию матрицы число 0
    GotoXY(hx, hy); // устанавливаем курсор в позицию игрока в консоль
    cout << ' ';    // и печатаем пробел
}

// функция показывает на экране игрока и записывает его в лабиринт
void ShowPlayer()
{
    maze[hy][hx] = 3; // записываем в текущую позицию матрицы число 0
    GotoXY(hx, hy); // устанавливаем курсор в позицию игрока в консоль
    cout << player; // и печатаем образ игрока
}

void MovePlayer(int dx, int dy)
{
    if (hx + dx < LX && hy + dy < LY && hx + dx >= 0 && hy + dy >= 0) // проверяем, если текущая позиция игрока > 0 - то перемещаться можно
    {
        switch (maze[hy + dy][hx + dx]) // проверяем, что находится в ячейке матрицы на строку выше
        {
        case 0:                  // если там пусто, то ход возможен.
            HidePlayer();       // вызываем функцию, которая скрывает игрока с экрана и убирает из текущей позиции матрицы
            hy += dy;               // уменьшаем координату y
            hx += dx;
            ShowPlayer();       // отображаем игрока в новой позиции
            break;
        case 2:                 // если там дверь выхода
            HidePlayer();       // по аналогии с вышестоящим кодом перемещаем игрока в новую позицию
            hy += dy;               // уменьшаем координату y
            hx += dx;
            ShowPlayer();
            UpdateScore(score += 500);  // добавляем 500 бонусов за достижение выхода из лабиринта
            gameState = 1;              // изменяем статус игры на ВЫИГРЫШ
            break;
        case 4:                 // если там монета
            HidePlayer();       // по аналогии с вышестоящим кодом перемещаем игрока в новую позицию
            hy += dy;               // уменьшаем координату y
            hx += dx;
            ShowPlayer();
            UpdateScore(score += 100); // добавляем 100 бонусов за сбор монеты
            break;
        case 5:                 // если там монета
            HidePlayer();       // по аналогии с вышестоящим кодом перемещаем игрока в новую позицию
            hy += dy;               // уменьшаем координату y
            hx += dx;
            ShowPlayer();
            UpdateScore(score += 300); // добавляем 100 бонусов за сбор монеты
            break;
        case 6:                 // если там монета
            HidePlayer();       // по аналогии с вышестоящим кодом перемещаем игрока в новую позицию
            hy += dy;               // уменьшаем координату y
            hx += dx;
            ShowPlayer();
            timeLimit += 10;
            break;
        case 7:                 // если там монета
            HidePlayer();       // по аналогии с вышестоящим кодом перемещаем игрока в новую позицию
            hy += dy;               // уменьшаем координату y
            hx += dx;
            ShowPlayer();
            if (score >= 200)
                UpdateScore(score -= 200);
            else UpdateScore(score -= score);
             // добавляем 100 бонусов за сбор монеты
            break;
        case 8:                 // если там монета
            HidePlayer();       // по аналогии с вышестоящим кодом перемещаем игрока в новую позицию
            hy += dy;               // уменьшаем координату y
            hx += dx;
            ShowPlayer();
            timeLimit -= 8;
            break;
        }
    }
}

// Функция обрабатывает события клавиатуры и управляет игрой
void Control()
{
    tstart = clock();  // запоминаем счетчик системного таймера в момент старта игры.
    UpdateScore(score); // обновляем счет игры, изначально он нулевой
    unsigned char x;  // это переменная хранит символ, соответствующий нажатой клавише
    while (gameState == 0)  // цикл игры - пока gameState == 0, игра идет
    {
        UpdateClock(clock());   // обновляем оставшееся время
        if (_kbhit())           // если была нажата клавиша - то обрабатываем ее, иначе следующая
        {                       // итерация игрового цикла
            x = _getch();       // считываем символ нажатой клавиш,
            if (x == 27) return;// если это символ Esc (27) то это выход из игры
            if (x == 0xe0)      // если это символ с кодом 0xE0 (шестнадцатеричное)
                switch (_getch()) // то считываем еще один символ (некоторые клавиши выдают двойные коды)
                {
                case 72:          // если 2-й символ код 72, то это клавиша курсор вверх
                    MovePlayer(0,-1);       // идем вверх
                    break;
                case 80:          // если 2-й символ код 80, то это клавиша курсор вниз
                    MovePlayer(0,1);   // идем вниз
                    break;
                case 75:        // если 2-й символ код 75, то это клавиша курсор влево
                    MovePlayer(-1,0);   // идем влево
                    break;
                case 77:
                    MovePlayer(1,0);  // если 2 - й символ код 77, то это клавиша курсор вправо
                    break;      // идем вправо
                }
        }
        Sleep(200);             // останавливаем игру на 200 мсек, если этого не делать, то
    }                           // обновление игры будет слишком быстрым, мы не сможем управлять
    if (gameState == 1)
    {
        char message[] = "Поздравляем, вы выбрались из лабиринта";
        FrameMessage(SCORETYPE, message, 38, WINCOL);
    }
    else if (gameState == 2)
    {

        char message[] = "Вы не успели выбраться из лабиринта, вы проиграли";
        FrameMessage(SCORETYPE, message, 49, LOSECOL);
    }
}                               // игроком, а также напрасно нагрузим процессор ненужной работой

// Функция main, которая выполняется при запуске прграммы
int main()
{
    bool error;
    system("mode con cols=80 lines=31");
    system("cls");
    error = FindFirstPlayerPosition(maze, LX, LY);
    if (error == false)
    {
        PrintMaze(maze, LX, LY);
        HideCursor();
        Control();
        ShowCursor();
    }
    else
    {
        char message[] = "Игра завершается в связи с инвалидностью лабиринта";
        FrameMessage(ORDINARYTYPE, message, 50, ERRORCOL);
    }
}

